# 2.
# Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
#
# 1) с помощью математических формул нахождения корней квадратного уравнения
#
# 2) с помощью дополнительных библиотек Python



# a = 3
# b = 34
# c = 8
#
# d = b ** 2 - 4 * a * c
#
# if d < 0:
#     print('нет корней')
#
# if d == 0:
#     print('Корень равен: ', -(b/(2*a)))
#
# if d > 0:
#     print('x1 = ', (-b + d ** 0.5) / 2 * a)
#     print('x1 = ', (-b - d ** 0.5) / 2 * a)


a = 3
b = 34
c = 8

import
